# ---------------------------------------------------------------------
# 入力された整数を３で割って(小数点以下にも対応)表示する未完成のプログラムがある。
# 選択肢から正しい答えを、選びなさい
# ---------------------------------------------------------------------

#ユーザーに整数を入力して貰う

# ------------------------------------
# 問１以下に当てはまる選択肢はどれか
# 1. prompt
# 2. print
# 3. input
# ------------------------------------
str = __(1)__("整数を入力して下さい：")


#入力された文字列を数値に変換する
num = int(str)

#数値を3で割る
# -------------------------------------
# 問２以下に当てはまる選択肢はどれか
# 1. num / 3
# 2. num // 3
# 3. num % 3
# -------------------------------------
num = __(2)__


#3で割った数値を表示する

# --------------------------------------
#問３以下に当てはまる選択肢はどれか
# 1. prompt
# 2. print
# 3. input
# --------------------------------------
__(3)__(num)

