##################################################
# 1～10までの整数の乱数を生成し、その乱数を１辺とする
# 正方形の面積を求める未完成プログラムがある。
# コメントを参考に空欄を埋めて、プログラムを完成させなさい。
##################################################

#randomモジュールのインポート
3. as rd
# ------------------------------------
# 問１ 当てはまる選択肢はどれか
# 1. from random
# 2. import Random
# 3. import random
# ------------------------------------



#randomモジュールの関数を用いて1~10の間の整数の乱数を生成する
rd_num = rd.3.(1,10)
# ------------------------------------
# 問２ 当てはまる選択肢はどれか
# 1. random
# 2. randint
# 3. randorange
# ------------------------------------


#乱数の表示
print("生成した乱数は",rd_num,"です。")
#関数を呼び出し、正方形の面積を表示
print("１辺が",rd_num,"の正方形の面積は",3.,"です。")
# ------------------------------------
# 問３ 当てはまる選択肢はどれか
# 1. rd_num*rd_num*3.14
# 2. rd_num*2
# 3. rd_num*rd_num
# ------------------------------------
