########################################################################
# 引数で送られてきた２つの点数の合計点を返却する関数を作成。
# その関数を用いて松本さんの合計点を求め、表示する未完成のプログラムがある。
# コメントを参考に空欄を埋めて、プログラムを完成させなさい。
########################################################################


#引数で送られてきた2つの点数の合計を求めて返却する関数を定義する
def calc_sum(score1,score2):
  return (1.)
# ------------------------------------
# 問１ 当てはまる選択肢はどれか
# 1. calc_sum
# 2. score1+score2
# 3. score1,score2
# ------------------------------------

#名前とテストの2回分の点数をまとめたタプルを定義する
#松本さん　85点,78点
test = ("松本",85,78)

#合計点を求め、結果を変数に格納する
sum = calc_sum(2.)
# ------------------------------------
# 問２ 当てはまる選択肢はどれか
# 1. test[1],test[2]
# 2. test[1:2]
# 3. test[0:1]
# -------------

#山田さんの合計点を表示する
print(test[0],"さんの合計点は", 3.,"点です")
# ------------------------------------
# 問３以下に当てはまる選択肢はどれか
# 1. amount
# 2. total
# 3. sum
# -------------
